In [1]:
import pandas
pandas.__version__

'1.0.5'

In [8]:
import pandas
pandas.read_csv(r'C:\Users\mryengala\Desktop\Pandas\data\gapminder.tsv' , sep ='\t')

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [5]:
import pandas as pd 
df = pd.read_csv(r'C:\Users\mryengala\Desktop\py\Pandas\data\gapminder.tsv' , sep ='\t')
# type of panda dataframe
type(df)

pandas.core.frame.DataFrame

In [6]:
# shape --No of records and columns
df.shape

(1704, 6)

In [7]:
#Info about data ,data tyype
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 66.6+ KB

In [8]:
df.head()
# head first five columns

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [9]:
df.tail()
# tail gives the last 5 columns

       country continent  year  lifeExp       pop   gdpPercap
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [11]:
df.columns
# columns give sthe names

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [12]:
df.index

RangeIndex(start=0, stop=1704, step=1)

In [13]:
df.values
## values gives the numpy array

array([['Afghanistan', 'Asia', 1952, 28.801, 8425333, 779.4453145],
       ['Afghanistan', 'Asia', 1957, 30.331999999999997, 9240934,
        820.8530296],
       ['Afghanistan', 'Asia', 1962, 31.997, 10267083, 853.1007099999999],
       ...,
       ['Zimbabwe', 'Africa', 1997, 46.809, 11404948, 792.4499602999999],
       ['Zimbabwe', 'Africa', 2002, 39.989000000000004, 11926563,
        672.0386227000001],
       ['Zimbabwe', 'Africa', 2007, 43.486999999999995, 12311143,
        469.70929810000007]], dtype=object)

In [16]:
df.values[[0]]

array([['Afghanistan', 'Asia', 1952, 28.801, 8425333, 779.4453145]],
      dtype=object)

In [17]:
df.dtypes
# dtypes gives the column objects and data type

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [19]:
country = df['country']
country
# this fetches the country field information

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [21]:
country = df[['country']]
country
# lists under lists denotes that we are filtrering some columns
## Outer one defines we select things
## inner one defines i'm going to select bunch of things

          country
0     Afghanistan
1     Afghanistan
2     Afghanistan
3     Afghanistan
4     Afghanistan
...           ...
1699     Zimbabwe
1700     Zimbabwe
1701     Zimbabwe
1702     Zimbabwe
1703     Zimbabwe

[1704 rows x 1 columns]

In [22]:
df.drop(['country'], axis ='columns')
## axis = 'columns' defines that we are dropping only column.

     continent  year  lifeExp       pop   gdpPercap
0         Asia  1952   28.801   8425333  779.445314
1         Asia  1957   30.332   9240934  820.853030
2         Asia  1962   31.997  10267083  853.100710
3         Asia  1967   34.020  11537966  836.197138
4         Asia  1972   36.088  13079460  739.981106
...        ...   ...      ...       ...         ...
1699    Africa  1987   62.351   9216418  706.157306
1700    Africa  1992   60.377  10704340  693.420786
1701    Africa  1997   46.809  11404948  792.449960
1702    Africa  2002   39.989  11926563  672.038623
1703    Africa  2007   43.487  12311143  469.709298

[1704 rows x 5 columns]

In [23]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [28]:
df.drop(['country'], axis ='columns', inplace=True)
##inplace = 'True' means it commits the transaction without making any copy.print If we want a copy we can assign the drop script to variable without using inplace.

In [29]:
df.head()

  continent  year  lifeExp       pop   gdpPercap
0      Asia  1952   28.801   8425333  779.445314
1      Asia  1957   30.332   9240934  820.853030
2      Asia  1962   31.997  10267083  853.100710
3      Asia  1967   34.020  11537966  836.197138
4      Asia  1972   36.088  13079460  739.981106

In [34]:
df.loc[[0,1]]
## loc defines the give output that has index 0 and 1
## index won't be in negative 
## loc is matching for variable

     continent  year  lifeExp       pop   gdpPercap
0         Asia  1952   28.801   8425333  779.445314
1         Asia  1957   30.332   9240934  820.853030
1703    Africa  2007   43.487  12311143  469.709298

In [35]:
df.iloc[[0,1,-1]]
## i loc is used to last column e
## iloc is matching for an index

     continent  year  lifeExp       pop   gdpPercap
0         Asia  1952   28.801   8425333  779.445314
1         Asia  1957   30.332   9240934  820.853030
1703    Africa  2007   43.487  12311143  469.709298

In [44]:
subset= df.loc[:,['year' ,'pop']]
subset
## : defines all the rows
## 3 defines 3rd row

      year       pop
0     1952   8425333
1     1957   9240934
2     1962  10267083
3     1967  11537966
4     1972  13079460
...    ...       ...
1699  1987   9216418
1700  1992  10704340
1701  1997  11404948
1702  2002  11926563
1703  2007  12311143

[1704 rows x 2 columns]

In [47]:
subset = df.iloc[:,[1,3]]
subset
## In iloc column needs to be defined by index
## use loc or iloc when we want to subset rows and Columns

      year       pop
0     1952   8425333
1     1957   9240934
2     1962  10267083
3     1967  11537966
4     1972  13079460
...    ...       ...
1699  1987   9216418
1700  1992  10704340
1701  1997  11404948
1702  2002  11926563
1703  2007  12311143

[1704 rows x 2 columns]

In [48]:
subset = df['continent']
subset

0         Asia
1         Asia
2         Asia
3         Asia
4         Asia
         ...
1699    Africa
1700    Africa
1701    Africa
1702    Africa
1703    Africa
Name: continent, Length: 1704, dtype: object

In [55]:
subset = df.loc[(df['continent']=='Asia')]
subset

     continent  year  lifeExp       pop    gdpPercap
0         Asia  1952   28.801   8425333   779.445314
1         Asia  1957   30.332   9240934   820.853030
2         Asia  1962   31.997  10267083   853.100710
3         Asia  1967   34.020  11537966   836.197138
4         Asia  1972   36.088  13079460   739.981106
...        ...   ...      ...       ...          ...
1675      Asia  1987   52.922  11219340  1971.741538
1676      Asia  1992   55.599  13367997  1879.496673
1677      Asia  1997   58.020  15826497  2117.484526
1678      Asia  2002   60.308  18701257  2234.820827
1679      Asia  2007   62.698  22211743  2280.769906

[396 rows x 5 columns]

In [62]:
continent=df.loc[(df['continent']=='Asia') & (df['year']==1952)]
continent
##Loc or Ioc is basically for filtering ROWS AND COLUMNS

     continent  year  lifeExp        pop      gdpPercap
0         Asia  1952   28.801    8425333     779.445314
84        Asia  1952   50.939     120447    9867.084765
96        Asia  1952   37.484   46886859     684.244172
216       Asia  1952   39.417    4693836     368.469286
288       Asia  1952   44.000  556263527     400.448611
660       Asia  1952   60.960    2125900    3054.421209
696       Asia  1952   37.373  372000000     546.565749
708       Asia  1952   37.468   82052000     749.681655
720       Asia  1952   44.869   17272000    3035.326002
732       Asia  1952   45.320    5441766    4129.766056
756       Asia  1952   65.390    1620914    4086.522128
792       Asia  1952   63.030   86459025    3216.956347
804       Asia  1952   43.158     607914    1546.907807
828       Asia  1952   50.056    8865488    1088.277758
840       Asia  1952   47.453   20947571    1030.592226
852       Asia  1952   55.565     160000  108382.352900
864       Asia  1952   55.928    1439529    4834.804067
936       Asia  1952   48.463    6748378    1831.132894
996       Asia  1952   42.244     800663     786.566857
1044      Asia  1952   36.319   20092996     331.000000
1068      Asia  1952   36.157    9182536     545.865723
1152      Asia  1952   37.578     507833    1828.230307
1164      Asia  1952   43.436   41346560     684.597144
1212      Asia  1952   47.752   22438691    1272.880995
1308      Asia  1952   39.875    4005677    6459.554823
1356      Asia  1952   60.396    1127000    2315.138227
1428      Asia  1952   57.593    7982342    1083.532030
1488      Asia  1952   45.883    3661549    1643.485354
1500      Asia  1952   58.500    8550362    1206.947913
1524      Asia  1952   50.848   21289402     757.797418
1644      Asia  1952   40.412   26246839     605.066492
1656      Asia  1952   43.160    1030585    1515.592329
1668      Asia  1952   32.548    4963829     781.717576

In [63]:
  df.groupby(['year'])[]

In [65]:
import numpy as Np

In [67]:
df.groupby(['year'])['lifeExp'].mean()
##groupby needs a some value column to calculate.

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [74]:
df.groupby(['year'])['lifeExp'].agg(Np.mean)
### we can use numpy library to calculate mean/std

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [79]:
df.groupby(['year','continent'])[['lifeExp','gdpPercap']].agg(Np.mean).reset_index()
## rest_index gives the output in index format

    year continent    lifeExp     gdpPercap
0   1952    Africa  39.135500   1252.572466
1   1952  Americas  53.279840   4079.062552
2   1952      Asia  46.314394   5195.484004
3   1952    Europe  64.408500   5661.057435
4   1952   Oceania  69.255000  10298.085650
5   1957    Africa  41.266346   1385.236062
6   1957  Americas  55.960280   4616.043733
7   1957      Asia  49.318544   5787.732940
8   1957    Europe  66.703067   6963.012816
9   1957   Oceania  70.295000  11598.522455
10  1962    Africa  43.319442   1598.078825
11  1962  Americas  58.398760   4901.541870
12  1962      Asia  51.563223   5729.369625
13  1962    Europe  68.539233   8365.486814
14  1962   Oceania  71.085000  12696.452430
15  1967    Africa  45.334538   2050.363801
16  1967  Americas  60.410920   5668.253496
17  1967      Asia  54.663640   5971.173374
18  1967    Europe  69.737600  10143.823757
19  1967   Oceania  71.310000  14495.021790
20  1972    Africa  47.450942   2339.615674
21  1972  Americas  62.394920   6491.334139
22  1972      Asia  57.319269   8187.468699
23  1972    Europe  70.775033  12479.575246
24  1972   Oceania  71.910000  16417.333380
25  1977    Africa  49.580423   2585.938508
26  1977  Americas  64.391560   7352.007126
27  1977      Asia  59.610556   7791.314020
28  1977    Europe  71.937767  14283.979110
29  1977   Oceania  72.855000  17283.957605
30  1982    Africa  51.592865   2481.592960
31  1982  Americas  66.228840   7506.737088
32  1982      Asia  62.617939   7434.135157
33  1982    Europe  72.806400  15617.896551
34  1982   Oceania  74.290000  18554.709840
35  1987    Africa  53.344788   2282.668991
36  1987  Americas  68.090720   7793.400261
37  1987      Asia  64.851182   7608.226508
38  1987    Europe  73.642167  17214.310727
39  1987   Oceania  75.320000  20448.040160
40  1992    Africa  53.629577   2281.810333
41  1992  Americas  69.568360   8044.934406
42  1992      Asia  66.537212   8639.690248
43  1992    Europe  74.440100  17061.568084
44  1992   Oceania  76.945000  20894.045885
45  1997    Africa  53.598269   2378.759555
46  1997  Americas  71.150480   8889.300863
47  1997      Asia  68.020515   9834.093295
48  1997    Europe  75.505167  19076.781802
49  1997   Oceania  78.190000  24024.175170
50  2002    Africa  53.325231   2599.385159
51  2002  Americas  72.422040   9287.677107
52  2002      Asia  69.233879  10174.090397
53  2002    Europe  76.700600  21711.732422
54  2002   Oceania  79.740000  26938.778040
55  2007    Africa  54.806038   3089.032605
56  2007  Americas  73.608120  11003.031625
57  2007      Asia  70.728485  12473.026870
58  2007    Europe  77.648600  25054.481636
59  2007   Oceania  80.719500  29810.188275